""" Вычислить число Пи c заданной точностью d

Пример:

    - при d = 0.0001,  π = 3.1415    10^-1 ≤ d ≤10^-10"""

 # https://ru.wikipedia.org/wiki/Алгоритм_Чудновского
# i = 1
#     # a = 13591409
#     # b = 545140134
#     # c = 640320
#     # f = c ** (3 / 2)
#     # g = a / f
#     # pi = None
#     # while str(pi)[:12] != '3.1415926535':
#     #     tmp = (-1 * fact(6) * (a + b) /
#     #            (fact(3) * fact(i) ** 3 * f * c ** (3)))
#     #     g += tmp
#     #     pi = 1 / (12 * g)
 # быстрый алгоритм для вычисления числа π


def pi_with_d(d):

    # Формула Бэйли — Боруэйна — Плаффа
    #
    my_pi = sum(1 / 16 ** x * (4 / (8 * x + 1) - 2 / (8 * x + 4) - 1 / (8 * x + 5) - 1 / (8 * x + 6)) for x in range(100))

    d = int(len(str(d)))

    print(str(my_pi)[:d])


pi_with_d("0.0000000001")
